In [4]:
import mysql.connector

db = mysql.connector.connect(
   host="localhost",
   user="root",
   passwd="data",
   db = "registrardb"
)

print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000025392167C48>

In [5]:
import pandas as pd

In [4]:
print("List the names, ids and major of students who are majored in Computer Engineering -(CE)\n")
q1 = pd.DataFrame(pd.read_sql_query("""
                       SELECT St_ID,St_Name,Major
                       FROM Student
                       where Major = 'CE'
                       """,
                       db
                       ))
print(q1.to_markdown())

List the names, ids and major of students who are majored in Computer Engineering -(CE)

|    |   St_ID | St_Name   | Major   |
|---:|--------:|:----------|:--------|
|  0 |   15013 | Dara      | CE      |
|  1 |   16009 | Alice     | CE      |
|  2 |   19009 | Lary      | CE      |
|  3 |   20102 | Xue       | CE      |

In [5]:
q2 = pd.DataFrame(pd.read_sql_query("""
                       SELECT St_ID,St_Name,Major,GPA
                       FROM student
                       where GPA >= 3.5
                       """,
                       db
                       ))
q2
# print(q2.to_markdown())

   St_ID St_Name Major   GPA
0  15010    Kyle    CS  3.50
1  15011    Mina    CS  3.60
2  15014     Ali   INE  3.70
3  16005    Rona  MATH  3.90
4  17011    Mary    CS  3.50
5  19003   Peter  MATH  3.90
6  19007     Roy  MATH  3.75
7  19009    Lary    CE  3.85
8  20101    Arya   Art  3.75

In [5]:
q3 = pd.DataFrame(pd.read_sql_query("""
   select  st.St_Name as StudentName, c.C_Name as CourseName,c.C_Id as CourseId
   , sc.Term, sc.Year,sc.P_Name as ProfName,g.Grade
    from student as st
        left join grade as g 		on g.St_ID = st.St_Id
        left join section as sc		on sc.S_Id = g.S_Id
        left join course as c		on c.C_Id = sc.C_Id
        where St_Name  = 'David'
                       """,
                       db
                       ))
print(q3.to_markdown())

|    | StudentName   | CourseName   | CourseId   | Term   |   Year | ProfName   |   Grade |
|---:|:--------------|:-------------|:-----------|:-------|-------:|:-----------|--------:|
|  0 | David         | Data Mining  | CIND850    | Summer |   2021 | Smith      |    3.45 |

In [6]:
q4 = pd.DataFrame(pd.read_sql_query("""
   select st.St_Name, st.St_Id, sc.S_Id, sc.C_Id, sc.Term, sc.Year, P_Name, g.Grade
        from section sc
            left join grade g			on g.S_ID = sc.S_ID
            inner join student  st		on g.St_Id = st.St_Id
            where C_Id = 'CPS510'

                       """,
                       db
                       ))
print(q4.to_markdown())

|    | St_Name   |   St_Id |   S_Id | C_Id   | Term   |   Year | P_Name   |   Grade |
|---:|:----------|--------:|-------:|:-------|:-------|-------:|:---------|--------:|
|  0 | Dara      |   15013 |     25 | CPS510 | Summer |   2019 | Smith    |    3.95 |